// 객체 (Object) - 자바스크립트의 객체


//[1] : 객체
// 자바스크립트 언어는 객체 기반의 언어이다. --> 객체를 선언하고 만들어 사용할 수 있다.
// 전통적은 프로그래밍 언어에서의 oop개념과는 조금 다르다. --> 그러나 점점 닮아가고 있다.


//[2] : 객체는 여러가지 자료형태의 데이터를 복합적으로 모아서 정의하는 데이터 타입이다.
// 이런 관점에서 본다면 --> C언어의 구조체와 유사하다.


//[3] : 원시형 (Primitive Type) vs 객체형 (Object Type)
// 원시 타입 --> 오직 하나의 데이터(문자열,숫자 등)만 담을 수 있는 자료형.
// 객체 타입 --> 원시 타입과는 달리 여러 가지 형태의 다양한 데이터를 담을 수 있는 자료형.


//[4] : 객체의 분류
//1.내장 객체 --> 언어 내부적으로 제공하는 객체 --> 브라우저 환경에 상관없이 일관된 결과를 기대한다.
//String,Date,Math,RegExp...등등

//2.BOM 객체 --> 브라우저에 내장된 객체.
//3.DOM 객체 --> 문서의 구조를 읽기 위한 객체.
//4.사용자 정의 객체 --> 사용자가 직접 정의하여 사용하는 객체


//보통 객체를 배운다고 하면 직접 정의하여 사용하는 "사용자 정의 객체"를 배운다고 생각하면 된다.